Revit 2026 API

# DocumentGetChangedElements Method

---

Extracts a collection containing the ids of elements that have been created, modified or deleted between the input baseVersion and the document's current version.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DocumentDifference GetChangedElements(
	Guid baseVersionGUID
)
```
```vb
Public Function GetChangedElements (
	baseVersionGUID As Guid
) As DocumentDifference
```
```cpp
public:
DocumentDifference^ GetChangedElements(
	Guid baseVersionGUID
)
```
```fsharp
member GetChangedElements :
        baseVersionGUID : Guid -> DocumentDifference
```

#### Parameters

baseVersionGUID Guid
     GUID of base version(excluded) to compare. This GUID should be retrieved from property [!:Autodesk::Revit::DB::DocumentVersion::VersoinGUID]. Empty GUID is allowed to retrieve changes of each version in the document.

#### Return Value

DocumentDifference An object containing collections of the created, modified and deleted ids between the input version and current version.

| Exception | Condition |
| --- | --- |
| ArgumentException | This GUID is invalid in the given document. |

#### Reference

Document Class

Autodesk.Revit.DB Namespace